
const chefs = new Map([
    ['Виктор', 'Пицца'],
    ['Ольга', 'Суши'],
    ['Дмитрий', 'Десерты']
  ]);
  
  
  
  const dishes = new Map([
    ['Пицца "Маргарита"', 'Виктор'],
    ['Пицца "Пепперони"', 'Виктор'],
    ['Суши "Филадельфия"', 'Ольга'],
    ['Суши "Калифорния"', 'Ольга'],
    ['Тирамису', 'Дмитрий'],
    ['Чизкейк', 'Дмитрий']
  ]);
  
 
  
  const orders = new Map();
  
  
  
  orders.set({name: 'Алексей'}, ['Пицца "Пепперони"', 'Тирамису']);
  orders.set({name: 'Мария'}, ['Суши "Калифорния"', 'Пицца "Маргарита"']);
  orders.set({name: 'Ирина'}, ['Чизкейк']);
  
  
  
  orders.forEach((dishes, client) => {
    console.log(`${client.name} заказал: ${dishes.join(', ')}`);
  });
